OpenFOAM-6-AP/tutorials/multiphase/interFoam/RAS/mixerVesselAMI/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
    "vessel.stl"
    "gasInlet.stl"
    "stirrer.stl"
    "outlet.stl"
    "shaft.stl"
    "shaftRotating.stl"
    "rotating.stl"
    "baffles.stl"
    "sparger.stl"
);

// Identify a feature when angle between faces < includedAngle
includedAngle       120;

// ************************************************************************* //
